package storage

import (
	"log"
	"os"
	"testing"

	"go.uber.org/zap"
)

var (
	fbStore ListFormatBanks
)

func TestMain(m *testing.M) {
	loggerTest, _ := zap.NewProduction() //InfoLevel json stderr
	//loggerTest, _ := zap.NewDevelopment() //console DebugLevel stderr
	//loggerTest := zap.NewExample() // json Stdout DebugLevel
	zap.ReplaceGlobals(loggerTest)

	fb := NewFormatBanks()
	err := fb.Open()
	if err != nil {
		log.Fatalf("Ошибка загрузки вариантов форматов. %v", err)
	}
	fbStore = *fb
	os.Exit(m.Run())
}

func TestDetectFormatBank(t *testing.T) {

	testCases := []struct {
		desc string
		text string
		want string
		err  error
	}{
		{
			desc: "Тест Почта_D7L1A3S5C6F2",
			text: `
			6149829;;Пушкинская, 240А, 50;;491;6.38;30.08.2018;
			6258413;;Орджоникидзе, 26А, 18;;50.11;0.65;30.08.2018;
			`,
			want: "Почта_D7L1A3S5C6F2",
			err:  nil,
		},
		{
			desc: "Тест Почта_D8L1A3S5С6F2",
			text: `
			19;7536.12;30.08.2018;03.09.2018;
			6149829;;Пушкинская, 240А, 50;;491;6.38;1731;30.08.2018;426008;42600805;
			6258413;;Орджоникидзе, 26А, 18;;50.11;0.65;2887;30.08.2018;426072;42607204;
			6105725;;Автозаводская, 17, 82;;266.36;3.46;24338;30.08.2018;426068;42606802;
			6083967;;Т.Барамзиной, 30, 53;;289.12;3.76;5149;30.08.2018;426067;42606702;
			6088539;;Фруктовая, 27, 39;;543.5;7.07;16009;30.08.2018;426054;42605401;
			`,
			want: "Почта_D8L1A3S5С6F2",
			err:  nil,
		},
		{
			desc: "Тест Сбербанк_D1L6A7S8C10",
			text: `
			20-04-2020;01-28-59;8618;8618999V;401087864321;700154937;ИЖЕВСК, ПАСТУХОВА, Д. 57, КВ. 75;683,46;676,63;6,83
			20-04-2020;03-14-38;8618;8618999V;451086752391;700041646;ИЖЕВСК, ЛИХВИНЦЕВА, Д. 66, КВ. 34;1200,00;1188,00;12,00
			20-04-2020;04-29-39;8618;8618999V;351058061713;700227299;ИЖЕВСК, Г.СТРОИТЕЛЕЙ, Д. 71А, КВ. 17;1578,16;1562,38;15,78
			`,
			want: "Сбербанк_D1L6A7S8C10",
			err:  nil,
		},
		{
			desc: "Тест Сбербанк_D3L7A8S5C6",
			text: `
			~Плательщик: Западно-Уральский банк Сбербанка России
			~Счет плательщика: 30233810749000600001
			~Банк плательщика:ЗАПАДНО-УРАЛЬСКИЙ БАНК ПАО СБЕРБАНК
			
			8618;8618999V;27/03/2017;9483893;2000.00;20.00;ЛИЦЕВОЙ СЧЕТ: 910000419; АДРЕС: Т.БАРАМЗИНОЙ 7А КВ 124;
			8618;8618999V;27/03/2017;552581;1716.22;17.16;ЛИЦЕВОЙ СЧЕТ: 300269; АДРЕС: БАРАНОВА 72 КВ 6;
			8618;8618999V;27/03/2017;567588;949.54;9.50;ЛИЦЕВОЙ СЧЕТ: 560290778; АДРЕС: ФРУКТОВАЯ 39 КВ 50;
			8618;8618999V;27/03/2017;586790;3233.94;32.34;ЛИЦЕВОЙ СЧЕТ: 309688; АДРЕС: ПУШКИНСКАЯ 245А КВ 2;
			8618;8618999V;27/03/2017;9539370;1052.84;10.53;ЛИЦЕВОЙ СЧЕТ: 700042375; АДРЕС: МОЛОДЕЖНАЯ 77 КВ 64;
			8618;8618999V;27/03/2017;591419;1093.76;10.94;ЛИЦЕВОЙ СЧЕТ: 700014313; АДРЕС: К.МАРКСА 425 КВ 32/3;			
			`,
			want: "Сбербанк_D3L7A8S5C6",
			err:  nil,
		},
		{
			desc: "Тест Сбербанк_D1L6A8S10C12F7",
			text: `
			25-09-2019;07-37-41;8618;8618999V;300863541515;910000667;КУМАЧЕВА ВЕРА АЛЕКСАНДРОВНА;ИЖЕВСК, Т.БАРАМЗИНОЙ, Д. 7А, КВ. 90;0819;3989,76;3945,87;43,89;5
			25-09-2019;07-46-35;8618;8618999V;350863558941;910000413;СУХИХ НАТАЛЬЯ АНАТОЛЬЕВНА;ИЖЕВСК, Т.БАРАМЗИНОЙ, Д. 7А, КВ. 118;0819;3566,25;3527,02;39,23;5
			25-09-2019;08-30-47;8618;8618999V;525310185611;910001248;БОРЦОВ ВЯЧЕСЛАВ АЛЕКСАНДРОВИЧ;ИЖЕВСК, Т.БАРАМЗИНОЙ, Д. 3А, КВ. 117;0819;2217,93;2193,53;24,40;5
			25-09-2019;08-41-55;8618;8618999V;252057486668;910001858;ЕМЕЛЬЯНОВ АНДРЕЙ ПЕТРОВИЧ;ИЖЕВСК, ЦВЕТОЧНАЯ, Д. 2, КВ. 96;0819;2652,69;2623,51;29,18;5
			25-09-2019;09-15-08;8618;8618999V;600619867091;910001707;БУРАШНИКОВА ЛИЛИЯ ФАРИТОВНА;ИЖЕВСК, Т.БАРАМЗИНОЙ, Д. 80, КВ. 37;0819;2245,27;2220,57;24,70;5
			25-09-2019;09-56-14;8618;8618999V;700503481402;910001132;ХОЛКИНА АЛЕВТИНА ВИКТОРОВНА;ИЖЕВСК, Т.БАРАМЗИНОЙ, Д. 3А, КВ. 2;0819;985,71;974,87;10,84;5
			`,
			want: "Сбербанк_D1L6A8S10C12F7",
			err:  nil,
		},
		{
			desc: "Тест Ижкомбанк_D2L4S3A5",
			text: `
			~Плательщик: АКБ "Ижкомбанк" (ПАО)
			~Счет плательщика: 40911810602201400221
			~Банк плательщика: АКБ "Ижкомбанк" (ПАО)
			~Корр. счет банка плательщика: 30101810900000000871
			~Получатель: Общество с ограниченной ответственностью "Единый Расчетный Центр"

			20190925001512897292;25/09/2019;1000.00; ЛИЦ.СЧЕТ: 700191647; АДРЕС: Ижевск, Кирова, д. 131, кв. 60; ФИО: ;;
			20190925083047899376;25/09/2019;1898.07; ЛИЦ.СЧЕТ: 700047227; АДРЕС: Ижевск, Красноармейская, д. 171, кв. 7; ФИО: ;;
			20190925083237899401;25/09/2019;1224.99; ЛИЦ.СЧЕТ: 700046809; АДРЕС: Ижевск, 7-я Подлесная, д. 34, кв. 30; ФИО: ;;
			20190925103926901020;25/09/2019;700.00; ЛИЦ.СЧЕТ: 700312230; АДРЕС: Ижевск, Удмуртская, д. 235, кв. 131; ФИО: ;;
			20190925170219905848;25/09/2019;706.79; ЛИЦ.СЧЕТ: 700063112; АДРЕС: Ижевск, Песочная, д. 32, кв. 11; ФИО: ;;
			20190925203049907411;25/09/2019;1580.16; ЛИЦ.СЧЕТ: 700040273; АДРЕС: Ижевск, Ключевой, д. 37, кв. 9; ФИО: ;;
			20190925115655902585;25/09/2019;1000.00; ЛИЦ.СЧЕТ: 700066845; АДРЕС: Ижевск, Школьная, д. 1, кв. 27; ФИО: ;;
			`,
			want: "Ижкомбанк_D2L4S3A5",
			err:  nil,
		},
		{
			desc: "Тест Сбербанк_D1L6A8S9C11F7",
			text: `
			01-10-2019;17-35-18;8618;8618999V;550319691514;20040341;КОРОБОВА СВЕТЛАНА ВЛАДИМИРОВНА;ИЖЕВСК, ВОСТОЧНАЯ, Д. 4, КВ. 34;10943,21;10735,29;207,92;
			01-10-2019;19-50-48;8618;8618999V;400805839118;20080161;НАГИМОВ МАРСЕЛЬ ДАМИРОВИЧ;ИЖЕВСК, ВОСТОЧНАЯ, Д. 8, КВ. 16;8254,77;8097,93;156,84;
			=2;19197,98;18833,22;364,76;835393;02-10-2019;
			`,
			want: "Сбербанк_D1L6A8S9C11F7",
			err:  nil,
		},
	}

	for _, tC := range testCases {
		t.Run(tC.desc, func(t *testing.T) {
			//reader := strings.NewReader(tC.text)
			got, err := fbStore.detectFormatBank([]byte(tC.text))
			if err != nil {
				t.Errorf("%s error: %v", tC.desc, err)
			}
			if got.Name != tC.want {
				t.Errorf("%s, got=%v, expected=%v", tC.desc, got.Name, tC.want)
			}

		})
	}

}
